---
kind: type
id: T:Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
source: html/08a43b98-428c-2bd4-d1c3-fc425563d67e.htm
---
# Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData

Represents the data and parameters of electrical analytical node.

## Syntax (C#)
```csharp
public class AnalyticalDistributionNodePropertyData : IDisposable
```